Revit 2016 API
RenderEngine Enumeration
 Controls Render Engine in use
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Since: 2014
Syntax
C#
public enum RenderEngine
Visual Basic
Public Enumeration RenderEngine
Visual C++
public enum class RenderEngine
Members
Member name | Description
MentalRay |  Mental Ray as render engine
RapidRT |  Rapid Ray Trace as render engine
See Also
Autodesk.Revit.DB Namespace